[Killed] ConditionalExpression
web-dev/silly-pascal-identifier/src/identifier.ts:2:7
 export function isValid (identifier: string): boolean {
-  if (identifier === null) {
+  if (true) {
     return false
   }

[Killed] BlockStatement
web-dev/silly-pascal-identifier/src/identifier.ts:2:28
 export function isValid (identifier: string): boolean {
-  if (identifier === null) {
-    return false
-  }
+  if (identifier === null) {}
   if (identifier.length < 1 || identifier.length > 6) {
     return false

[Killed] BooleanLiteral
web-dev/silly-pascal-identifier/src/identifier.ts:3:12
 export function isValid (identifier: string): boolean {
   if (identifier === null) {
-    return false
+    return true
   }
   if (identifier.length < 1 || identifier.length > 6) {

[Killed] ConditionalExpression
web-dev/silly-pascal-identifier/src/identifier.ts:5:7
   if (identifier === null) {
     return false
   }
-  if (identifier.length < 1 || identifier.length > 6) {
+  if (false) {
     return false
   }

[Killed] LogicalOperator
web-dev/silly-pascal-identifier/src/identifier.ts:5:29
   if (identifier === null) {
     return false
   }
-  if (identifier.length < 1 || identifier.length > 6) {
+  if (identifier.length < 1 && identifier.length > 6) {
     return false
   }

[Killed] BooleanLiteral
web-dev/silly-pascal-identifier/src/identifier.ts:6:12
     return false
   }
   if (identifier.length < 1 || identifier.length > 6) {
-    return false
+    return true
   }
   if (!/^[a-zA-Z]+$/.test(identifier.charAt(0)) ||

[Killed] LogicalOperator
web-dev/silly-pascal-identifier/src/identifier.ts:8:49
   if (identifier.length < 1 || identifier.length > 6) {
     return false
   }
-  if (!/^[a-zA-Z]+$/.test(identifier.charAt(0)) ||
+  if (!/^[a-zA-Z]+$/.test(identifier.charAt(0)) &&
       !/^[0-9a-zA-Z]+$/.test(identifier)) {
     return false

[Killed] BooleanLiteral
web-dev/silly-pascal-identifier/src/identifier.ts:8:7
   if (identifier.length < 1 || identifier.length > 6) {
     return false
   }
-  if (!/^[a-zA-Z]+$/.test(identifier.charAt(0)) ||
+  if (/^[a-zA-Z]+$/.test(identifier.charAt(0)) ||
       !/^[0-9a-zA-Z]+$/.test(identifier)) {
     return false

[Killed] BooleanLiteral
web-dev/silly-pascal-identifier/src/identifier.ts:9:7
     return false
   }
   if (!/^[a-zA-Z]+$/.test(identifier.charAt(0)) ||
-      !/^[0-9a-zA-Z]+$/.test(identifier)) {
+      /^[0-9a-zA-Z]+$/.test(identifier)) {
     return false
   }

[Killed] BlockStatement
web-dev/silly-pascal-identifier/src/identifier.ts:9:43
     return false
   }
   if (!/^[a-zA-Z]+$/.test(identifier.charAt(0)) ||
-      !/^[0-9a-zA-Z]+$/.test(identifier)) {
-    return false
-  }
+      !/^[0-9a-zA-Z]+$/.test(identifier)) {}
   return true
 }

[Killed] BooleanLiteral
web-dev/silly-pascal-identifier/src/identifier.ts:10:12
   }
   if (!/^[a-zA-Z]+$/.test(identifier.charAt(0)) ||
       !/^[0-9a-zA-Z]+$/.test(identifier)) {
-    return false
+    return true
   }
   return true

[Killed] BooleanLiteral
web-dev/silly-pascal-identifier/src/identifier.ts:12:10
       !/^[0-9a-zA-Z]+$/.test(identifier)) {
     return false
   }
-  return true
+  return false
 }
 
