[Killed] EqualityOperator
web-dev/software-testing-exercises/src/identifier.ts:5:25
   if (identifier === null) {
     return false
   }
-  if (identifier.length < 1 || identifier.length > 6) {
+  if (identifier.length <= 1 || identifier.length > 6) {
     return false
   }

[Killed] EqualityOperator
web-dev/software-testing-exercises/src/identifier.ts:5:50
   if (identifier === null) {
     return false
   }
-  if (identifier.length < 1 || identifier.length > 6) {
+  if (identifier.length < 1 || identifier.length >= 6) {
     return false
   }

[Killed] ConditionalExpression
web-dev/software-testing-exercises/src/identifier.ts:8:7
   if (identifier.length < 1 || identifier.length > 6) {
     return false
   }
-  if (!/^[a-zA-Z]+$/.test(identifier.charAt(0)) ||
-      !/^[0-9a-zA-Z]+$/.test(identifier)) {
+  if (true) {
     return false
   }
